InstructorList/app/controllers/main_controller.rb

  def list
	@instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

  def new_record

      @instructor_name = params[:instructor_name]
      @instructor_office_number = params[:instructor_office_number]
      @instructor_email = params[:instructor_email]

      @new_instructor = Instructor.create(name: @instructor_email, office_number: @instructor_office_number, email: @instructor_email)
---
INSERT INTO "instructors" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-09-21 01:04:52.181214"], ["updated_at", "2014-09-21 01:04:52.181214"]]